app/Http/Controllers/Front/CartController.php

select * from `products` where `products`.`id` = '9' limit 1
---
    public function add_to_cart(Request $request)
    {
        if ($request->ajax()) {
            $output = array();
            $id = $request->product_id;
            $qty = $request->qty;
            $product_attribute_size = $request->product_attribute_size;
            $product_attribute_color = $request->product_attribute_color;
            $sizename = $request->sizename;
            $colorname = $request->colorname;
            $product_info = Product::find($id);