app/Http/Controllers/Front/CheckoutController.php

    public function checkAuthentication(Request $request)
    {

        $mobile = $request->mobile;
        $user = User::where('mobile', $mobile)->first();

        if ($user != null) {
            return response()->json(['status' => 'success'], 200);
        } else {
            $user = new User();
            $user->mobile = $request->mobile;
            $user->status = 2;
            $user->save();
---
select * from `users` where `mobile` = '01714613653' limit 1
insert into `users` (`mobile`, `status`, `updated_at`, `created_at`) values ('01714613653', '2', '2024-10-28 13:42:19', '2024-10-28 13:42:19')

    public function confirmOrder(Request $request)
    {
        Validator::make($request->all(), [
            'name' => 'required',
            'mobile' => 'required',
            'address' => 'required'
        ]);

        $user = User::where('mobile', $request->mobile)->first();
        if ($user->firstname !== $request->name || $user->address !== $request->address) {
            $user->firstname = $request->name;
            $user->address = $request->address;
            $user->save();
---
select * from `users` where `mobile` = '01714613653' limit 1
update `users` set `firstname` = 'Anam', `address` = 'Test address', `updated_at` = '2024-10-28 13:43:12' where `id` = '46'

                    $cartPro->product_qty = $pro->qty;
                    $cartPro->sub_total = $pro->price * $pro->qty;
                    $cartPro->save();
                    $product = Product::find($pro->id);
                    $product->decrement('product_qty', $pro->qty);
                    $product->update();
                    $attributeProduct_id = AttributeProduct::where('product_id', $pro->id)
                        ->where('attribute_id', $pro->options->size)
                        ->where('color_id', $pro->options->color)->first();
---
select * from `products` where `products`.`id` = '9' limit 1
update `products` set `product_qty` = `product_qty` - 1, `updated_at` = '2024-10-28 13:45:32' where `id` = '9'
select * from `attribute_product` where `product_id` = '9' and `attribute_id` is null and `color_id` is null limit 1