app/Http/Controllers/Front/Dashboard.php

select * from `orders` where `user_id` = '46' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `orders` where `user_id` = '46'
---
    public function orders($status = null)
    {
        $data['activeMenu'] = 'orders';
        $data["userInfo"] = \Auth::user();
        $order_posts_per_page = SM::smGetThemeOption("order_posts_per_page", config('constant.smPagination'));
        $data['status'] = $status;
        if ($status != null) {
            $data["orders"] = Order::where("user_id", \Auth::user()->id)
                ->where("order_status", $status)
                ->orderBy("id", 'desc')
                ->paginate($order_posts_per_page);
        } else {
            $data["orders"] = Order::where("user_id", \Auth::user()->id)
                ->orderBy("id", 'desc')
                ->paginate($order_posts_per_page);

select * from `orders` where `user_id` = '46' and `orders`.`id` = '13' limit 1
select * from `payments` where `payments`.`id` in ('')
select * from `users` where `users`.`id` in ('46')
---
    public function detailOrders($id)
    {
        Cart::instance('cart')->destroy();
        $data["order"] = Order::with('payment', 'user', 'detail')
            ->where("user_id", \Auth::user()->id)
            ->find($id);