app/Http/Controllers/Front/ProductController.php

                ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
                ->leftJoin('attribute_product', 'products.id', 'attribute_product.product_id')
                ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
                ->select('products.*')
                ->when($brand_filter, function ($query) use ($brand_filter) {
                    if ($brand_filter != "") {
                        return $query->whereIn('products.brand_id', $brand_filter);
                    }
                })
                ->when($category_filter, function ($query) use ($category_filter) {
                    if ($category_filter != "") {
                        return $query->whereIn('categoryables.category_id', $category_filter);
                    }
                })
                ->when($minimum_price, function ($query) use ($minimum_price, $maximum_price) {
                    if ($minimum_price != "" && $maximum_price != "") {
                        return $query->whereBetween('products.regular_price', array($minimum_price, $maximum_price));
                    }
                })
                ->when($size_filter, function ($query) use ($size_filter) {
                    if ($size_filter != "") {
                        return $query->whereIn('attribute_product.attribute_id', $size_filter);
                    }
                })
                ->when($color_filter, function ($query) use ($color_filter) {
                    if ($color_filter != "") {
                        return $query->whereIn('attribute_product.color_id', $color_filter);
                    }
                })
                ->when($orderBy, function ($query) use ($orderBy) {
                    if ($orderBy != "") {
                        return $query->orderBy('products.regular_price', $orderBy);
                    } else {
                         return $query->orderBy('products.id','desc');
                    }
                })
---
select count(*) as aggregate from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` left join `attribute_product` on `products`.`id` = `attribute_product`.`product_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' group by `products`.`id`

    public function productDetail($slug)
    {
        $data["product"] = SM::getCache('product_' . $slug, function () use ($slug) {
            return Product::with("categories", "user")
                ->where("slug", $slug)
                ->where("status", 1)
                ->first();
        });
//        if (count($data["product"]) > 0) {
        if (!empty($data["product"])) {
            $data['smAdminBarId'] = $data["product"]->id;
            $data["product"]->increment("views");
            $data["relatedProduct"] = SM::getCache('product_related_product_' . $slug, function () use ($data) {
                $product_related_per_page = SM::smGetThemeOption("product_related_per_page", 6);
                $cats = SM::get_ids_from_data($data['product']->categories);

                return DB::table("products")
                    ->select('products.*')
                    ->join("categoryables", function ($join) {
                        $join->on("categoryables.categoryable_id", "=", "products.id")
                            ->where("categoryables.categoryable_type", '=', 'App\Model\Common\Product');
                    })
                    ->whereIn("categoryables.category_id", $cats)
                    ->where("products.id", '!=', $data["product"]->id)
                    ->where("products.status", 1)
                    ->orderBy("products.id", "desc")
                    ->limit($product_related_per_page)
                    ->get();
            });
---
select * from `products` where `slug` = 'short-shirt-three-pcs-123' and `status` = '1' limit 1
select * from `users` where `users`.`id` in ('1')
update `products` set `views` = `views` + 1, `updated_at` = '2024-10-28 12:03:06' where `id` = '32'
select `categories`.*, `categoryables`.`categoryable_id` as `pivot_categoryable_id`, `categoryables`.`category_id` as `pivot_category_id` from `categories` inner join `categoryables` on `categories`.`id` = `categoryables`.`category_id` where `categoryables`.`categoryable_id` in ('32') and `categoryables`.`categoryable_type` = 'App\Model\Common\Product'
select `products`.* from `products` inner join `categoryables` on `categoryables`.`categoryable_id` = `products`.`id` and `categoryables`.`categoryable_type` = 'App\Model\Common\Product' where `categoryables`.`category_id` in ('1', '2') and `products`.`id` != '32' and `products`.`status` = '1' order by `products`.`id` desc limit 6