app/SM/SM_Front.php

select * from `categories` where `parent_id` = '2'
---
    public static function category_tree_for_select_cat_id($category_id, $segment = null)
    {
        $category_data = Category::where('parent_id', $category_id)->get();

select * from `settings` where `option_name` = 'is_maintenance_enable' limit 1
---
    public static function get_setting_value($option_name, $default = null)
    {
        if (self::sm_string($option_name)) {
            if (isset(self::$settings_autoload[$option_name])) {
                return self::$settings_autoload[$option_name];
            } else {
                self::initSettingAutoLoad();
                if (isset(self::$settings_autoload[$option_name])) {
                    return self::$settings_autoload[$option_name];
                } else {
                    $setting = Setting::where('option_name', $option_name)->first();

select * from `settings` where `autoload` = '1'
---
    public static function initSettingAutoLoad()
    {
        $settings_autoload = Cache::rememberForever("setting_autoload", function () {
            return Setting::where('autoload', 1)->get();

select * from `payment_methods` where `id` = '0' limit 1
---
public  static function get_payment_method_by_id($method_id)
    {
        $payment_methods = DB::table('payment_methods')->find($method_id);

select * from `visitors` where `date` = '2024-10-28' limit 1
update `visitors` set `views` = `views` + 1 where `id` = '1147'
insert into `visitors` (`date`, `views`) values ('2024-10-29', '1')
---
    public static function sm_daily_visit()
    {
        $date = date('Y-m-d');
        if (!(Session::has('views') && session('views') == $date) || !Session::has('views')) {
            $date = date('Y-m-d');
//      $date = '2016-06-25';
            $visitor = Visitor::where('date', $date)->first();
            if ($visitor) {
                $visitor->increment('views');
            } else {
                $visitor = new Visitor();
                $visitor->date = $date;
                $visitor->views = 1;
                $visitor->save();

select * from `categories` where `parent_id` = '0'
---
    public static function getMainCategories($isWithHaveNoProduct = 1)
    {
        if ($isWithHaveNoProduct == 1) {
            return SM::getCache('main_categories_have_not_post', function () {
                return Category::where('parent_id', 0)->get();
            });
        } else {
            return SM::getCache('main_categories_have_posts', function () {
//                return Category::where("total_posts", ">", 0)
//                    ->get();
                return Category::where('parent_id', 0)->get();

select * from `wishlists` where `product_id` = '11' and `user_id` = '46' limit 1
---
    public static function quickViewHtml($product_id = null, $slug = null)
    {
        $quick_view_html = '';
        if (Auth::check()) {
            $check_wishlist = Wishlist::where('product_id', $product_id)->where('user_id', Auth::id())->first();

select * from `products` where `products`.`id` = '33' limit 1
---
    public static function addToCartButton($product_id = null, $regular_price = null, $sale_price = null, $addClass = null)
    {

        $product = Product::find($product_id);

select * from `products` where `products`.`id` = '39' limit 1
---
    public static function productDiscount($product_id = null)
    {
        $product = Product::find($product_id);

select * from `categories` where `parent_id` = '8'
select `products`.* from `products` inner join `categoryables` on `products`.`id` = `categoryables`.`categoryable_id` where `categoryables`.`categoryable_type` = 'App\Model\Common\Product' and `categoryables`.`category_id` in ('8') group by `products`.`id` order by `products`.`regular_price` asc limit 7
---
    static function categoryProducts($category_id = null)
    {
        $subcat_id[] = $category_id;
        $subcategory_id = Category::where('parent_id', $category_id)->get();
        if (!empty($subcategory_id)) {
            foreach ($subcategory_id as $item) {
                $subcat_id[] = $item->id;
            }
        }

        $get_products = DB::table('products')
            ->join('categoryables', 'products.id', 'categoryables.categoryable_id')
            ->where('categoryables.categoryable_type', 'App\Model\Common\Product')
            ->whereIn('categoryables.category_id', $subcat_id)
            ->select('products.*')
            ->orderBy('products.regular_price', 'asc')
            ->groupBy('products.id')
//            ->skip(1)
            ->take(7)
            ->get();

select * from `attribute_product` where `product_id` = '39' order by `id` asc limit 1
---
 public static function getAttributeByProductId($product_id = null)
    {
        $attribute = \App\Model\Common\AttributeProduct::where('product_id', $product_id)
            ->orderBy('id', 'ASC')
            ->first();